/******************************************************************************

Напишите программу на языке C для определения максимального
из трёх чисел с использованием вложенных операторов if.

*******************************************************************************/
#include <stdio.h>

int main()
{
    int num1, num2, num3;
    scanf("%d %d %d", &num1, &num2, &num3);
    
    int max = num1;
    if (num1 >= num2) {
        if (num1 >= num3) {
            max = num1;
        } else {
            max = num3;
        }
    } else {
        if (num2 >= num3) {
            max = num2;
        } else {
            max = num3;
        }
    }
    printf("%d", max);
    return 0;
}
