/******************************************************************************

Требуется определить, бьет ли слон, стоящий на клетке с
указанными координатами (номер строки и номер столбца),
фигуру, стоящую на другой указанной клетке. 
Вводятся четыре числа: координаты слона и координаты другой фигуры.

*******************************************************************************/
#include <stdio.h>
#include <stdlib.h>

int main()
{
    char bishop_x, target_x;
    int bishop_y, target_y;
    scanf("%c%d %c%d", &bishop_x, &bishop_y, &target_x, &target_y);
    
    if (abs(bishop_x - target_x) == abs(bishop_y - target_y)) {
        printf("YES\n");
    } else {
        printf("NO\n");
    }

    return 0;
}